{"format": "graph-model", "generatedBy": "2.18.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"keras_tensor_8": {"name": "keras_tensor_8:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}, {"size": "41"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/dense_2_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "41"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/dense_2_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "41"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "_has_manual_control_dependencies": {"b": true}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/input/_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "2048"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "2048"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/input/_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2048"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/strided_slice_3/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/strided_slice_3/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/strided_slice_3/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/embedding_2_1/GatherV2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "41"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/embedding_2_1/Less/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/embedding_2_1/strided_slice", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/embedding_2_1/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "keras_tensor_8", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/embedding_2_1/Cast", "op": "Cast", "input": ["keras_tensor_8"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_2_1/embedding_2_1/Less", "op": "Less", "input": ["StatefulPartitionedCall/sequential_2_1/embedding_2_1/Cast", "StatefulPartitionedCall/sequential_2_1/embedding_2_1/Less/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/embedding_2_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_2_1/embedding_2_1/Cast", "StatefulPartitionedCall/sequential_2_1/embedding_2_1/strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/embedding_2_1/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/sequential_2_1/embedding_2_1/Less", "StatefulPartitionedCall/sequential_2_1/embedding_2_1/add", "StatefulPartitionedCall/sequential_2_1/embedding_2_1/Cast"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/embedding_2_1/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/sequential_2_1/embedding_2_1/GatherV2/ReadVariableOp", "StatefulPartitionedCall/sequential_2_1/embedding_2_1/SelectV2", "StatefulPartitionedCall/sequential_2_1/embedding_2_1/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_2_1/embedding_2_1/GatherV2"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential_2_1/embedding_2_1/GatherV2", "StatefulPartitionedCall/sequential_2_1/lstm_2_1/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/Shape", "StatefulPartitionedCall/sequential_2_1/lstm_2_1/strided_slice/stack", "StatefulPartitionedCall/sequential_2_1/lstm_2_1/strided_slice/stack_1", "StatefulPartitionedCall/sequential_2_1/lstm_2_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/Shape_1", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/transpose"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/transpose", "StatefulPartitionedCall/sequential_2_1/lstm_2_1/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/strided_slice", "StatefulPartitionedCall/sequential_2_1/lstm_2_1/zeros_1/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/strided_slice", "StatefulPartitionedCall/sequential_2_1/lstm_2_1/zeros/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/strided_slice_3", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/Shape_1", "StatefulPartitionedCall/sequential_2_1/lstm_2_1/strided_slice_3/stack", "StatefulPartitionedCall/sequential_2_1/lstm_2_1/strided_slice_3/stack_1", "StatefulPartitionedCall/sequential_2_1/lstm_2_1/strided_slice_3/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "_has_manual_control_dependencies": {"b": true}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/zeros_1/packed", "StatefulPartitionedCall/sequential_2_1/lstm_2_1/zeros_1/Const"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/zeros/packed", "StatefulPartitionedCall/sequential_2_1/lstm_2_1/zeros/Const"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential_2_1/lstm_2_1/strided_slice_3"], "attr": {"shape_type": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/LoopControlInputs/_22", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential_2_1/lstm_2_1/TensorArrayV2_1", "^StatefulPartitionedCall/sequential_2_1/lstm_2_1/zeros_1", "^StatefulPartitionedCall/sequential_2_1/lstm_2_1/zeros", "^StatefulPartitionedCall/sequential_2_1/lstm_2_1/TensorArrayUnstack/TensorListFromTensor"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/enter/_11", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/loop_counter", "^StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/LoopControlInputs/_22"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yXzEvbHN0bV8yXzEvd2hpbGU="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/enter/_18", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/TensorArrayUnstack/TensorListFromTensor", "^StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/LoopControlInputs/_22"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yXzEvbHN0bV8yXzEvd2hpbGU="}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/enter/_14", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/TensorArrayV2_1", "^StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/LoopControlInputs/_22"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yXzEvbHN0bV8yXzEvd2hpbGU="}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/enter/_12", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/strided_slice_3", "^StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/LoopControlInputs/_22"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yXzEvbHN0bV8yXzEvd2hpbGU="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/enter/_17", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/strided_slice_3", "^StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/LoopControlInputs/_22"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yXzEvbHN0bV8yXzEvd2hpbGU="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/enter/_15", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/zeros", "^StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/LoopControlInputs/_22"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yXzEvbHN0bV8yXzEvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/enter/_16", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/zeros_1", "^StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/LoopControlInputs/_22"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yXzEvbHN0bV8yXzEvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/enter/_13", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/time", "^StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/LoopControlInputs/_22"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yXzEvbHN0bV8yXzEvd2hpbGU="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/enter/_19", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_2", "^StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/LoopControlInputs/_22"], "attr": {"is_constant": {"b": true}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yXzEvbHN0bV8yXzEvd2hpbGU="}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/enter/_20", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_3", "^StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/LoopControlInputs/_22"], "attr": {"is_constant": {"b": true}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yXzEvbHN0bV8yXzEvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "_has_manual_control_dependencies": {"b": true}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/enter/_21", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_4", "^StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/LoopControlInputs/_22"], "attr": {"is_constant": {"b": true}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8yXzEvbHN0bV8yXzEvd2hpbGU="}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/merge/_23", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/enter/_11", "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/next_iteration/_50"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/merge/_30", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/enter/_18", "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/next_iteration/_57"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/merge/_26", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/enter/_14", "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/next_iteration/_53"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/merge/_24", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/enter/_12", "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/next_iteration/_51"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/merge/_29", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/enter/_17", "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/next_iteration/_56"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/merge/_27", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/enter/_15", "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/next_iteration/_54"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/merge/_28", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/enter/_16", "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/next_iteration/_55"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/merge/_25", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/enter/_13", "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/next_iteration/_52"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/cond/_9/input_control_node/_58", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/enter/_19", "^StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/enter/_20", "^StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/enter/_21", "^StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/merge/_23", "^StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/merge/_24", "^StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/merge/_25", "^StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/merge/_26", "^StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/merge/_27", "^StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/merge/_28", "^StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/merge/_29", "^StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/merge/_30"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/cond/_9/sequential_2_1/lstm_2_1/while/Less_1", "op": "Less", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/merge/_23", "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/merge/_24", "^Func/StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/cond/_9/input_control_node/_58"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/cond/_9/sequential_2_1/lstm_2_1/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/merge/_25", "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/merge/_29", "^Func/StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/cond/_9/input_control_node/_58"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/cond/_9/sequential_2_1/lstm_2_1/while/LogicalAnd", "op": "LogicalAnd", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/cond/_9/sequential_2_1/lstm_2_1/while/Less_1", "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/cond/_9/sequential_2_1/lstm_2_1/while/Less"]}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/LoopCond/_31", "op": "LoopCond", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/cond/_9/sequential_2_1/lstm_2_1/while/LogicalAnd"]}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/StatefulPartitionedCall/sequential_2_1/lstm_2_1/TensorArrayV2_1_switch/_35", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/merge/_26", "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/LoopCond/_31"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/StatefulPartitionedCall/sequential_2_1/lstm_2_1/strided_slice_3_switch/_33", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/merge/_24", "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/LoopCond/_31"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/StatefulPartitionedCall/sequential_2_1/lstm_2_1/strided_slice_3_switch/_38", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/merge/_29", "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/LoopCond/_31"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/StatefulPartitionedCall/sequential_2_1/lstm_2_1/zeros_1_switch/_37", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/merge/_28", "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/LoopCond/_31"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/StatefulPartitionedCall/sequential_2_1/lstm_2_1/TensorArrayUnstack/TensorListFromTensor_switch/_39", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/merge/_30", "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/LoopCond/_31"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/StatefulPartitionedCall/sequential_2_1/lstm_2_1/time_switch/_34", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/merge/_25", "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/LoopCond/_31"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/StatefulPartitionedCall/sequential_2_1/lstm_2_1/zeros_switch/_36", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/merge/_27", "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/LoopCond/_31"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/loop_counter_switch/_32", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/merge/_23", "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/LoopCond/_31"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/exit/_44", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/StatefulPartitionedCall/sequential_2_1/lstm_2_1/TensorArrayV2_1_switch/_35"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/exit/_42", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/StatefulPartitionedCall/sequential_2_1/lstm_2_1/strided_slice_3_switch/_33"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/exit/_47", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/StatefulPartitionedCall/sequential_2_1/lstm_2_1/strided_slice_3_switch/_38"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/exit/_46", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/StatefulPartitionedCall/sequential_2_1/lstm_2_1/zeros_1_switch/_37"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/exit/_48", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/StatefulPartitionedCall/sequential_2_1/lstm_2_1/TensorArrayUnstack/TensorListFromTensor_switch/_39"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/exit/_43", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/StatefulPartitionedCall/sequential_2_1/lstm_2_1/time_switch/_34"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/exit/_45", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/StatefulPartitionedCall/sequential_2_1/lstm_2_1/zeros_switch/_36"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/exit/_41", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/loop_counter_switch/_32"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/loop_body_control/_40", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/loop_counter_switch/_32:1"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/exit/_44", "StatefulPartitionedCall/sequential_2_1/lstm_2_1/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"num_elements": {"i": "-1"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/input_control_node/_71", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/StatefulPartitionedCall/sequential_2_1/lstm_2_1/TensorArrayUnstack/TensorListFromTensor_switch/_39", "^StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/StatefulPartitionedCall/sequential_2_1/lstm_2_1/TensorArrayV2_1_switch/_35", "^StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/StatefulPartitionedCall/sequential_2_1/lstm_2_1/strided_slice_3_switch/_33", "^StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/StatefulPartitionedCall/sequential_2_1/lstm_2_1/strided_slice_3_switch/_38", "^StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/StatefulPartitionedCall/sequential_2_1/lstm_2_1/time_switch/_34", "^StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/loop_body_control/_40", "^StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/StatefulPartitionedCall/sequential_2_1/lstm_2_1/zeros_1_switch/_37", "^StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/StatefulPartitionedCall/sequential_2_1/lstm_2_1/zeros_switch/_36", "^StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/enter/_19", "^StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/enter/_20", "^StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/enter/_21"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/sequential_2_1/lstm_2_1/transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/add_1/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/input_control_node/_71"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/lstm_cell_1/split/split_dim", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/input_control_node/_71"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/add/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/input_control_node/_71"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/input/_74", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/StatefulPartitionedCall/sequential_2_1/lstm_2_1/time_switch/_34:1", "^Func/StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/input_control_node/_71"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/input_control_node/_71"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/lstm_cell_1/Cast/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/enter/_19", "^Func/StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/input_control_node/_71"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "2048"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/lstm_cell_1/Cast_1/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/enter/_20", "^Func/StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/input_control_node/_71"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "2048"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/lstm_cell_1/add_1/ReadVariableOp", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/enter/_21", "^Func/StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/input_control_node/_71"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2048"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/dense_2_1/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/transpose_1", "StatefulPartitionedCall/sequential_2_1/dense_2_1/Cast/ReadVariableOp"], "attr": {"grad_y": {"b": false}, "adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_x": {"b": false}, "adj_y": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/loop_counter_switch/_32:1", "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/add_1/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/add", "op": "AddV2", "input": ["Func/StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/input/_74", "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/add/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/StatefulPartitionedCall/sequential_2_1/lstm_2_1/TensorArrayUnstack/TensorListFromTensor_switch/_39:1", "Func/StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/input/_74", "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/TensorArrayV2Read/TensorListGetItem/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/lstm_cell_1/MatMul_1", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/StatefulPartitionedCall/sequential_2_1/lstm_2_1/zeros_switch/_36:1", "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/lstm_cell_1/Cast_1/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "grad_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_b": {"b": false}, "transpose_b": {"b": false}}}, {"name": "Func/StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/output_control_node/_94", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/lstm_cell_1/Cast/ReadVariableOp", "^StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/lstm_cell_1/Cast_1/ReadVariableOp", "^StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/lstm_cell_1/add_1/ReadVariableOp"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/NoOp", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/lstm_cell_1/Cast/ReadVariableOp", "^StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/lstm_cell_1/Cast_1/ReadVariableOp", "^StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/lstm_cell_1/add_1/ReadVariableOp"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_2_1/dense_2_1/Add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_2_1/dense_2_1/MatMul", "StatefulPartitionedCall/sequential_2_1/dense_2_1/Add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/lstm_cell_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/lstm_cell_1/add_1/ReadVariableOp", "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/lstm_cell_1/MatMul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/next_iteration/_56", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/StatefulPartitionedCall/sequential_2_1/lstm_2_1/strided_slice_3_switch/_38:1", "^Func/StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/output_control_node/_94", "^Func/StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/input_control_node/_71"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/next_iteration/_57", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/StatefulPartitionedCall/sequential_2_1/lstm_2_1/TensorArrayUnstack/TensorListFromTensor_switch/_39:1", "^Func/StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/output_control_node/_94", "^Func/StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/input_control_node/_71"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/next_iteration/_50", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/add_1", "^Func/StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/output_control_node/_94", "^StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/NoOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/next_iteration/_51", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/StatefulPartitionedCall/sequential_2_1/lstm_2_1/strided_slice_3_switch/_33:1", "^Func/StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/output_control_node/_94", "^StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/NoOp", "^Func/StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/input_control_node/_71"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/next_iteration/_52", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/add", "^Func/StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/output_control_node/_94", "^StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/NoOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_2_1/dense_2_1/Add", "^StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/exit/_48", "^StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/exit/_46", "^StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/exit/_42", "^StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/exit/_43", "^StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/exit/_47", "^StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/exit/_44", "^StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/exit/_45", "^StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/exit/_41"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/lstm_cell_1/add_1", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/TensorArrayV2Read/TensorListGetItem", "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/lstm_cell_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/lstm_cell_1/add"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/lstm_cell_1/split", "op": "Split", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/lstm_cell_1/split/split_dim", "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/lstm_cell_1/add_1"], "attr": {"num_split": {"i": "4"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/lstm_cell_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/lstm_cell_1/split"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/lstm_cell_1/Sigmoid_1", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/lstm_cell_1/split:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/lstm_cell_1/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/lstm_cell_1/split:2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/lstm_cell_1/Sigmoid_2", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/lstm_cell_1/split:3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/lstm_cell_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/lstm_cell_1/Sigmoid_1", "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/StatefulPartitionedCall/sequential_2_1/lstm_2_1/zeros_1_switch/_37:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/lstm_cell_1/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/lstm_cell_1/Sigmoid", "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/lstm_cell_1/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/lstm_cell_1/add_2", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/lstm_cell_1/mul", "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/lstm_cell_1/mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/lstm_cell_1/Tanh_1", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/lstm_cell_1/add_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/next_iteration/_55", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/lstm_cell_1/add_2", "^Func/StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/output_control_node/_94", "^StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/NoOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/lstm_cell_1/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/lstm_cell_1/Sigmoid_2", "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/lstm_cell_1/Tanh_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/TensorArrayV2Write/TensorListSetItem", "op": "TensorListSetItem", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/StatefulPartitionedCall/sequential_2_1/lstm_2_1/TensorArrayV2_1_switch/_35:1", "Func/StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/input/_74", "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/lstm_cell_1/mul_2"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "resize_if_index_out_of_bounds": {"b": false}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/next_iteration/_54", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/lstm_cell_1/mul_2", "^Func/StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/output_control_node/_94", "^StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/NoOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/next_iteration/_53", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/TensorArrayV2Write/TensorListSetItem", "^Func/StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/output_control_node/_94", "^StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/body/_10/sequential_2_1/lstm_2_1/while/NoOp"], "attr": {"T": {"type": "DT_VARIANT"}}}], "library": {}, "versions": {"producer": 1994}}, "weightsManifest": [{"paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/TensorArrayV2Stack/TensorListStack/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/transpose_1/perm", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_2_1/dense_2_1/Cast/ReadVariableOp", "shape": [512, 41], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2_1/dense_2_1/Add/ReadVariableOp", "shape": [41], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/while/loop_counter", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/time", "shape": [], "dtype": "int32"}, {"name": "Func/StatefulPartitionedCall/input/_2", "shape": [128, 2048], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_3", "shape": [512, 2048], "dtype": "float32"}, {"name": "Func/StatefulPartitionedCall/input/_4", "shape": [2048], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/TensorArrayV2_1/element_shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/strided_slice_3/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/strided_slice_3/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/strided_slice_3/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/zeros_1/packed/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/zeros_1/Const", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_2_1/lstm_2_1/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": 